fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <comment>Бозырь С.Р. 10.07.2025</comment>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <comment>Бозырь С.Р. 19.07.2025</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСотрудника</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <comment>Бозырь С.Р. 10.07.2025</comment>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <comment>Бозырь С.Р. 19.07.2025</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	Если ЭтоНовый() Тогда
			
		ДатаПроведения = Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy; ДП=-;");
		НачалоРабот = Формат(ВремяНачалаРаботПлан, "ДЛФ=T; ДП=-;");
		ОкончаниеРабот = Формат(ВремяОкончанияРаботПлан, "ДЛФ=T; ДП=-;");
		НазначенныйСпециалист = ?(ЗначениеЗаполнено(Специалист), Специалист, "не назначен");
		
		ТекстСообщения = СтрШаблон("Создана новая заявка на обслуживание клиента %1! %2 Специалист: %3 %2 Проведение работ запланировано на %4 с %5 по %6",
									Клиент, Символы.ПС, НазначенныйСпециалист, ДатаПроведения, НачалоРабот, ОкончаниеРабот);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
			|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан,
			|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан
			|ПОМЕСТИТЬ ВТ_СтарыеДанные
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_СтарыеДанные.Специалист.Наименование КАК СтароеЗначение,
			|	&Специалист КАК НовоеЗначение,
			|	""Специалист"" КАК Реквизит
			|ИЗ
			|	ВТ_СтарыеДанные КАК ВТ_СтарыеДанные
			|ГДЕ
			|	ВТ_СтарыеДанные.Специалист <> &Специалист
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ_СтарыеДанные.ДатаПроведенияРабот,
			|	&ДатаПроведенияРабот,
			|	""Дата проведения работ""
			|ИЗ
			|	ВТ_СтарыеДанные КАК ВТ_СтарыеДанные
			|ГДЕ
			|	ВТ_СтарыеДанные.ДатаПроведенияРабот <> &ДатаПроведенияРабот
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ_СтарыеДанные.ВремяНачалаРаботПлан,
			|	&ВремяНачалаРаботПлан,
			|	""Время начала работ""
			|ИЗ
			|	ВТ_СтарыеДанные КАК ВТ_СтарыеДанные
			|ГДЕ
			|	ВТ_СтарыеДанные.ВремяНачалаРаботПлан <> &ВремяНачалаРаботПлан
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ_СтарыеДанные.ВремяОкончанияРаботПлан,
			|	&ВремяОкончанияРаботПлан,
			|	""Время окончания работ""
			|ИЗ
			|	ВТ_СтарыеДанные КАК ВТ_СтарыеДанные
			|ГДЕ
			|	ВТ_СтарыеДанные.ВремяОкончанияРаботПлан <> &ВремяОкончанияРаботПлан";
		
		Запрос.УстановитьПараметр("Специалист", Специалист);
		Запрос.УстановитьПараметр("ДатаПроведенияРабот", ДатаПроведенияРабот);
		Запрос.УстановитьПараметр("ВремяНачалаРаботПлан", ВремяНачалаРаботПлан);
		Запрос.УстановитьПараметр("ВремяОкончанияРаботПлан", ВремяОкончанияРаботПлан);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ТекстИзменений = "";
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Реквизит = ВыборкаДетальныеЗаписи.Реквизит; 
			
			Если Реквизит = "Дата проведения работ" Тогда
				НовоеЗначение = Формат(ВыборкаДетальныеЗаписи.НовоеЗначение, "ДФ=dd.MM.yyyy; ДП=-;");
				СтароеЗначение = Формат(ВыборкаДетальныеЗаписи.СтароеЗначение, "ДФ=dd.MM.yyyy; ДП=-;");
			ИначеЕсли Реквизит = "Время начала работ" Или ВыборкаДетальныеЗаписи.Реквизит = "Время окончания работ" Тогда
				НовоеЗначение = Формат(ВыборкаДетальныеЗаписи.НовоеЗначение, "ДЛФ=T; ДП=-;");
				СтароеЗначение = Формат(ВыборкаДетальныеЗаписи.СтароеЗначение, "ДЛФ=T; ДП=-;");
			Иначе
				НовоеЗначение = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НовоеЗначение), ВыборкаДетальныеЗаписи.НовоеЗначение, "-");
				СтароеЗначение = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СтароеЗначение), ВыборкаДетальныеЗаписи.СтароеЗначение, "-");
			КонецЕсли;
						
			ТекстИзменений = СтрШаблон("%1%2%3: %4 (пред. значение: %5)", ТекстИзменений, Символы.ПС, Реквизит, НовоеЗначение, СтароеЗначение); 
			
		КонецЦикла;
		
		Если ТекстИзменений <> "" Тогда
			
			ТекстСообщения = СтрШаблон("В заявку на обслуживание клиента %1 внесены изменения! %2", Клиент, ТекстИзменений);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		ВКМ_Телеграм.СоздатьУведомлениеТелеграмБоту(ТекстСообщения);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// Проверка договора и определение стоимости часа работы
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ДоговорыКонтрагентов.Представление КАК ПредставлениеДоговора,
		|	ДоговорыКонтрагентов.ПометкаУдаления
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстСообщения = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			
			ТекстСообщения = СтрШаблон("Вид выбранного договора %1 - %2. Необходимо выбрать договор с видом ""Абонентское обслуживание""", ВыборкаДетальныеЗаписи.ПредставлениеДоговора, ВыборкаДетальныеЗаписи.ВидДоговора);
			
		ИначеЕсли Дата < ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора Или Дата > ВыборкаДетальныеЗаписи.ДатаОкончанияДействияДоговора Тогда
			
			ТекстСообщения = СтрШаблон("Дата документа абонентского обслуживания должна попадать в период действия договора");
		
		ИначеЕсли ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
			
			ТекстСообщения = СтрШаблон("Выбранный договор %1 помечен на удаление!");
			
		Иначе
				
			СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;	
		
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = СтрШаблон("Не удалось получить данные по договору");
		
	КонецЕсли;
		
	Если ТекстСообщения <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
			
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка и получение процента за работу сотрудника
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Специалист) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстСообщения = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
		ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентОтРабот;	
		
	Иначе
		
		ТекстСообщения = СтрШаблон("Для сотрудника %1 не задан процент от работ", Специалист);
		
	КонецЕсли;
		
	Если ТекстСообщения <> "" Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
			
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Запись данных в регистры выполненных работ
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы;
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы * ПроцентОтРабот / 100;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
